import React, {useContext, useState} from 'react';
import { useNavigate } from 'react-router-dom';
import {Collapse} from 'react-collapse';

import Logo from '../images/logo/SakuraTails.svg';
import Basket from '../images/icons/basket.svg';
import Profile from '../images/icons/profile.svg';
import Box from '../images/icons/box.svg';
import Amex from '../images/pay/amex.png';
import Apple from '../images/pay/apple.png';
import F from '../images/pay/f.png';
import Discover from '../images/pay/discover.png';
import Google from '../images/pay/google.png';
import Mastercard from '../images/pay/mastercard.png';
import Paypal from '../images/pay/paypal.png';
import Shop from '../images/pay/shop.png';
import V from '../images/pay/v.png';
import Visa from '../images/pay/visa.png';
import Instagram from '../images/socials/instagram.svg';
import X from '../images/socials/x.svg';
import Facebook from '../images/socials/facebook.svg';
import Tiktok from '../images/socials/tiktok.svg';
import Qr from '../images/pay/qr.svg';
import WhiteWolf from '../images/logo/white-wolf.svg';
import Spread from '../images/icons/spread.svg';
import HelloEmoji from '../images/icons/hello-emoji.svg';
import AddPlus from '../images/icons/add-plus.svg';
import Exit from '../images/icons/exit.svg';
import History from '../images/icons/history.svg';
import Transfer from '../images/icons/transfer.svg';
import Like from '../images/icons/like.svg';
import Pen from '../images/icons/pen.svg';
import Wallet from '../images/icons/wallet.svg';
import Procent from '../images/icons/procent.svg';
import Case from '../images/icons/case.svg';

import { useAuth } from './providers/AuthProvider';

function App() {
    return <Logo />;
    return <Basket />;
    return <Spread />;
    return <Profile />;
    return <WhiteWolf />;
    return <Amex />;
    return <Apple />;
    return <F />;
    return <Discover />;
    return <Google />;
    return <Mastercard />;
    return <Paypal />;
    return <Shop />;
    return <V />;
    return <Visa />;
    return <Instagram />;
    return <X />;
    return <Facebook />;
    return <Tiktok />;
    return <Qr />;
    return <HelloEmoji />;
    return <AddPlus />;
    return <Exit />;
    return <History />;
    return <Transfer />;
    return <Like />;
    return <Pen />;
    return <Wallet />;
    return <Procent />;
    return <Case />;
  }

  export default function HomePage() {
    const {user} = useAuth();
    const navigate = useNavigate();
    const [isProfileModalOpen, setIsProfileModalOpen] = useState("");

    const handleHeadClick = (e) => {
      e.preventDefault();
      if (!user) {
        navigate('/authorization');
      } else {
        setIsProfileModalOpen(!isProfileModalOpen);
      }
    };

    const handleSellerProfileClick = () => {
        navigate("/seller");
    };

    const handleSettingsClick = () => {
        navigate("/profile-settings")
    };

    return (
        <body className='pol-body'>
        <><><header>
              <section className='header-section'>
                <div className='head-div'>
                    <div className='head-left-div'>
                    <div className='head-nav-div'>
                      <a className='header-link header-link-market' href='/catalog'>Каталог</a>
                      </div>
                      <div className='head-nav-div'>
                      <a className='header-link' href='https://www.figma.com/'>Подарунки</a>
                      </div>
                      </div>
                  <div className='head-logo-div'>
                  <a className='head-logo' href='/'>SakuraTails</a>
                  </div>
                  <div className='head-right-div'>
                    <div className='head-nav-div'>
                        <a className='header-link' href='https://www.figma.com/'>Про нас</a>
                    </div>
                    <div className='head-nav-div'>
                        <a className='header-link' href='https://www.figma.com/'>Коробки</a>
                    </div>
                    <div className='head-nav-div'>
                        <a href='#' className='icon-head'>
                            <img src={Basket}></img>
                        </a>
                    </div>
                    <div className='head-nav-div dropdown-header'>
                        <a href='#' className='icon-head' onClick={handleHeadClick}>
                            <img src={Profile}></img>
                        </a>
                        {user && (
                            <div className="dropdown-content-header" style={{ display: isProfileModalOpen ? "block" : "none" }}>
                                <div>
                                    <p className='head-email-dropdown'>{user.email}</p>
                                </div>
                                <div>
                                    <p className='hello-dropdown'>Вітаємо, <span className='name-dropdown'>{user.displayName}</span> <img src={HelloEmoji} alt="Hello Emoji" /></p>
                                </div>
                                <div>
                                    <button className='dropdown-border-top-button'><img src={History} alt="History" />Історія замовлень</button>
                                </div>
                                <div>
                                    <button className='dropdown-button'><img src={Transfer} alt="Transfer" />Відстеження замовлення</button>
                                </div>
                                <div>
                                    <button className='dropdown-button'><img src={Like} alt="Like" />Обране</button>
                                </div>
                                <div>
                                    <button className='dropdown-button'><img src={Pen} alt="Pen" />Мої відгуки</button>
                                </div>
                                <div>
                                    <button className='dropdown-button'><img src={Wallet} alt="Wallet" />Мій гаманець</button>
                                </div>
                                <div>
                                    <button className='dropdown-border-bottom-button'><img src={Procent} alt="Procent" />Знижки та бонуси</button>
                                </div>
                                <div>
                                    <button className='dropdown-button dropdown-button-exit'><img src={Exit} alt="Exit" />Вийти з акаунта</button>
                                </div>
                                <div>
                                    <button className='dropdown-border-left-button' onClick={handleSettingsClick}>Налаштування</button>
                                    <button className='dropdown-border-right-button'>Довідка</button>
                                </div>
                                <div onClick={handleSellerProfileClick}>
                                    <button className='dropdown-border-bottom-button'><img src={Case} alt="Case" />Кабінет продавця</button>
                                </div>
                                <div>
                                    <p className='bottom-dropdown'>
                                        <a href=''>Privacy Policy</a><span className='slash-dropdown'>/</span><a href=''> Terms of Service</a>
                                    </p>
                                </div>
                            </div>
                        )}
                    </div>
                  {/* <div className='language-div'>
                    <div className='language-left-div'>
                      <a className='language-link-left language-link'>
                        <p>EN</p>
                      </a>
                    </div>
                    <div className='language-right-div'>
                    <a className='language-link-right language-link'>
                        <p>UA</p>
                      </a>
                    </div>
                  </div> */}
                  </div>
                  </div>
              </section>
          </header>
              <main>
              <div class="container-pol">
        <div class="section-pol">
            <h1>Політика конфіденційності</h1>
            <p>SakuraTails («SakuraTails», «Sakura», «Tails», «ми» або «нас»), оператор цього веб-сайту, зобов'язується зберігати конфіденційність тих, хто відвідує сайт [ваш сайт], shop.sakura-tails.com (у цьому документі описано, як ми обробляємо різні джерела інформації, отриманої під час вашого відвідування Сайту та послуг (збір даних). Ця Політика конфіденційності не поширюється на інформацію, зібрану за допомогою Сервісів, її частиною Умов та положень Сайту та включена в них.</p><br/>

            <p>Ця Політика конфіденційності пояснює, як і чому ми збираємо інформацію про наших клієнтів і що ми з нею робимо.</p><br/>

            <p class="pbold">ЦЯ ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ НЕ ПОШИРЮЄТЬСЯ НА ІНШІ ВЕБ-САЙТИ АБО ОНЛАЙН-СЕРВІСИ. ВИ ПОГОДЖУЄТЕСЯ, ЩО ВИКОРИСТАННЯ ВАМИ САЙТУ, ДОДАТКУ АБО ПОСЛУГ ОЗНАЧАЄ ВАШУ ЗГОДУ З ЦІЄЮ ПОЛІТИКОЮ КОНФІДЕНЦІЙНОСТІ. ЯКЩО ВИ НЕ ЗГОДНІ З ЦІЄЮ ПОЛІТИКОЮ КОНФІДЕНЦІЙНОСТІ, ВИ НЕ МАЄТЕ ПРАВА ВИКОРИСТОВУВАТИ ЦЕЙ САЙТ, ДОДАТОК АБО НАШІ ПОСЛУГИ.</p>
        </div>
        <h2>ЗІБРАНА ІНФОРМАЦІЯ</h2>
        <div class="section-pol">
            <h3>Особиста інформація</h3>
            <p>Якщо ви підписуєтеся на SakuraTails та/або розміщуєте у нас замовлення, ми попросимо вас вказати ваше ім'я, адресу електронної пошти, адресу доставки, номер телефону та платіжну інформацію або іншу іншу особисту інформацію про вас («Персональна інформація»). Ми також можемо попросити вас надати демографічну інформацію.</p><br/>
    
            <p>Ми використовуємо цю інформацію для обробки та відправлення вашого замовлення, а також для повідомлення про його статус. Інколи ми використовуємо вашу адресу електронної пошти виключно для зв'язку з вами щодо замовлення. Крім того, коли ви берете участь у конкурсі, опитуванні, анкетуванні, потрібне від вас підтвердження наявності акцій, ми можемо попросити вас вказати ваше ім'я, адресу та адресу електронної пошти або іншу особисту інформацію.</p><br/>
    
            <p>Ми збираємо від нашого клієнта різну інформацію під час і після використання сайту. Наприклад, коли користувач Служби обміну повідомленнями. Наприклад, ми збираємо номер телефону та/або адресу електронної пошти, які ви вказали під час реєстрації в Службі обміну повідомленнями. Ми можемо також зберігати іншу персональну інформацію або інформацію про вас у складі файлів cookie або подібних технологій. Файли cookie – це фрагменти інформації, які зберігаються вашим браузером на жорсткому диску вашого комп'ютера. Вони дозволяють веб-сайту розпізнавати вас під час наступного відвідування, підказувати вашу електронну пошту або зберігати товари у вашому кошику для покупок і не можуть використовуватися для запуску програм або передачі вірусів на ваш комп'ютер. Ви можете відключити файли cookie у вашому браузері, але в такому випадку ви не зможете здійснити покупку на сайті.</p><br/>
    
            <p>Ми також збираємо інформацію про вас, коли ви взаємодієте з нашими мережами. Якщо ви надсилаєте нам повідомлення або відмічаєте нас у соціальних мережах, ми зберігаємо ці повідомлення.</p><br/>
    
            <p class="pbold">За винятком випадків, описаних у цій Політиці, SakuraTails не надає особисту інформацію, включаючи вашу адресу електронної пошти, будь-яким іншим третім особам без вашого прямого дозволу.</p><br/>
        </div>
    
        <div class="section-pol">
            <h3>Автоматично зібрані ДАНІ</h3>
            <p>Крім того, ми також автоматично збираємо інформацію про використання вами нашого Сайту, таких як ваша IP-адреса входу, переглянуті сторінки та функції, які ви використовували. Ми також можемо збирати інформацію про пристрій, з якого ви підключені або використовували додатку та особливості використовуваного інтернет-браузера. Ця інформація допомагає нам зрозуміти, як використовуються наші Послуги, і вжити відповідних заходів для вдосконалення їхньої функціональності.</p>
        </div>

        <div class="section-pol">
            <h3>ЯК МИ ВИКОРИСТОВУЄМО ВАШІ ДАНІ</h3>
            <p>Ми використовуємо вашу інформацію, включаючи особисту інформацію, для наступних цілей:</p>
        </div>
        
        <div class="section-pol">
            <h3>РОЗШИРЕНИЙ ТА ПЕРСОНАЛІЗОВАНИЙ ДОСВІД ПОКУПОК</h3>
            <p>Ми використовуємо Персональні дані для того, щоб зробити ваш досвід покупок більш приємним і зручним, а також для того, щоб допомогти нам ідентифікувати та/або надати інформацію, продукти або послуги, які можуть вас зацікавити. Ми використовуємо вашу Персональну інформацію для підтримки та покращення використання вами Сайту, його функцій та наших Послуг, включаючи, без обмежень: виконання вашого замовлення; обслуговування клієнтів; адаптацію контенту та інформації, яку ми можемо надсилати або відображати вам; відстеження електронних запрошень, які ви надсилаєте; а також для підтримки використання вами Сайту в інший спосіб.</p><br/>
            <p>Ми також можемо відстежувати минулі покупки, щоб надати вам персоналізований профіль вашої історії покупок і робити персоналізовані рекомендації та пропозиції. Крім того, ми можемо повідомляти вас про нові послуги або спеціальні рекламні програми, або надсилати вам повідомлення, пропозиції або інформацію про наші продукти та послуги, а також про продукти та послуги інших сторін, які, на нашу думку, можуть вас зацікавити.</p>
        </div>

        <div class="section-pol">
            <h3>РЕКЛАМА ТА АНАЛІТИКА</h3>
            <p>Ми використовуємо зібрану нами інформацію, щоб допомогти нам визначити відповідний рекламний контент і засоби масової інформації для показу, як на нашому Сайті, так і на неафілійованих веб-сайтах і в засобах масової інформації, а також для вимірювання успіху наших рекламних кампаній. Ми також використовуємо зібрану інформацію для створення користувацьких аудиторій і схожих аудиторій для наших рекламних кампаній в Інтернеті.</p><br/>
            <p>Ми аналізуємо інформацію, яку збираємо, щоб краще зрозуміти, як користувачі отримують доступ до наших Сайтів і Сервісів і використовують їх, як на сукупній, так і на індивідуальній основі. Наприклад, ми оцінюємо, які функції наших Сервісів користуються найбільшою (або найменшою) популярністю серед користувачів, і використовуємо цю інформацію для оновлення або додавання нових функцій до наших Сервісів. Ми також можемо використовувати відгуки користувачів для оновлення наших Сервісів або розробки нових пропозицій. Ми можемо надсилати вам опитування та анкети для оцінки задоволеності клієнтів, залучення користувачів, для дослідження ринку або інших цілей.</p><br/>
            <p>Як описано вище, ми можемо створювати зведену інформацію, анонімізовані, псевдонімізовані або деідентифіковані набори даних з інформації, яку ми збираємо. Ми можемо використовувати такі набори даних для досліджень, вдосконалення та розвитку продуктів і послуг, маркетингу, реклами, аналізу тенденцій та інших цілей.
            </p>
        </div>

        <div class="section-pol">
            <h3>ДЛЯ ДІЛОВИХ ТА ЮРИДИЧНИХ ЦІЛЕЙ</h3>
            <p>Як і всі компанії, ми використовуємо зібрану нами інформацію для виконання юридичних зобов'язань і дій відповідно до законних дозволів, в рамках наших загальних ділових операцій і для інших цілей управління бізнесом, в тому числі для дотримання наших законодавчих і нормативних вимог, підтвердження вашої особи, ведення обліку користувачів, контролю за дотриманням вами укладених з нами угод, стягнення заборгованості, захисту наших ділових інтересів, а також для управління або передачі наших активів або зобов'язань, наприклад, в разі придбання, відчуження, злиття або реорганізації, як описано нижче. Ми також будемо використовувати вашу інформацію, якщо вважатимемо за необхідне розслідувати, запобігати або вживати заходів щодо незаконної діяльності, підозр у шахрайстві, ситуацій, пов'язаних із потенційною загрозою безпеці будь-якої особи або власності, або порушень цієї Політики, будь-якої угоди, яку ви уклали з нами, та будь-яких застосовних положень та умов.</p><br/>
            <p>Час від часу ми можемо інформувати вас про інші цілі, для яких ми можемо використовувати вашу інформацію. Якщо це вимагається чинним законодавством, ми отримаємо вашу згоду, якщо захочемо використовувати вашу особисту інформацію для цілей, що вимагають такої згоди.</p><br/>
            <p class="pbold">як ми ділимося вашою інформацією</p>
        </div>

        <div class="section-pol">
            <h3>ФІЛІЇ; КОНСУЛЬТАНТИ; ТРЕТІ ОСОБИ</h3>
            <p>У зв'язку з наданням послуг з обслуговування та експлуатації Сервісів і певних функцій Сервісів, певні довірені постачальники послуг можуть мати доступ до вашої інформації. Наприклад, ми можемо використовувати постачальників послуг для розміщення Сайту; управління різними функціями, доступними в Послугах; надсилання електронних листів; аналізу даних; надання результатів пошуку та посилань, а також допомоги у виконанні ваших замовлень.</p><br/>
            <p>Крім нас, доступ до цієї інформації мають лише наші афілійовані особи, технічні консультанти, сторонні аудитори та інші сторони, які роблять наш Сайт доступним, покращують його функціональність, допомагають в обробці ваших покупок або надають супутні послуги та/або співпрацюють з вами в наданні контенту, зразків, продуктів, подарунків і призів.</p><br/>
            <p>Якщо ви берете участь в спільноті SakuraTails або відмічаєте нас у соціальних мережах, ми можемо опублікувати ваше ім'я та контент, який ви відмітили (наприклад, ваші фотографії або відео), на наших Сервісах і в наших акаунтах у соціальних мережах. Якщо ви публікуєте відгук, ваш відгук буде доступний усім відвідувачам Сайту та Сервісів.</p>
        </div>

        <div class="section-pol">
            <h3>ІНФОРМАЦІЯ, ЩО СТОСУЄТЬСЯ РЕКЛАМИ</h3>
            <p>Для підтримки та вдосконалення Сервісів ми можемо показувати рекламу, а також дозволяти рекламу третіх сторін через Сервіси. Ця реклама іноді націлена на конкретних користувачів і може надходити від сторонніх компаній, які називаються «рекламними мережами». Рекламні мережі включають сторонні рекламні сервери, рекламні агентства, постачальників рекламних технологій і дослідницькі фірми. Рекламні мережі можуть використовувати файли cookie, JavaScript, веб-маяки (включаючи прозорі GIF-файли), Flash LSO та інші технології відстеження в Інтернеті для вимірювання ефективності своєї реклами та персоналізації рекламного контенту для вас. Ці файли cookie та інші технології регулюються конкретною політикою конфіденційності кожної рекламної мережі, а не цією. Ми можемо надавати цим сторонам інформацію про вас, включаючи особисту інформацію, щоб допомогти нам у проведенні наших рекламних кампаній. Ми можемо співпрацювати з рекламними мережами, які є членами або організаціями чи програмами, що керують параметрами конфіденційності реклами, які ці рекламні мережі пропонують споживачам.</p><br/>

            <p>Коли ви відвідуєте наш Сайт або користуєтеся нашими мобільними додатками чи іншими Послугами, рекламні мережі та інші сторони можуть збирати інформацію про ваші дії в Інтернеті з плином часу та на різних веб-сайтах. Ми не несемо відповідальності за політику конфіденційності цих рекламних мереж та інших сторін.</p><br/>

            <p>Реклама, що надається через Послуги, може бути націлена на користувачів, які відповідають певній загальній категорії профілю, що може бути виведено з інформації, наданої нам користувачем, може ґрунтуватися на моделях використання Послуг конкретними користувачами або може ґрунтуватися на вашій активності на інших веб-сайтах, мобільних додатках і в засобах масової інформації. Ми також можемо розкривати певну інформацію (наприклад, вашу адресу електронної пошти) рекламним мережам, включаючи Facebook, щоб ми могли краще таргетувати рекламу та контент для вас та інших людей зі схожими інтересами на інших веб-сайтах або в засобах масової інформації («Користувацька аудиторія»). Ми також можемо співпрацювати з іншими рекламними мережами та маркетинговими платформами, які дозволяють нам та іншим учасникам націлювати рекламу на Користувацьку аудиторію, подану нами та іншими. Ви також можете контролювати те, як Facebook та інші рекламні мережі показують вам певні оголошення, як пояснюється далі у їхніх відповідних політиках конфіденційності або за допомогою описаних нижче відмов.</p>
        </div>
    <ul>
        <li>
            Щоб дізнатися більше про ці рекламні мережі та відмову від відстеження через NAI, відвідайте тут.
        </li>
        <li>
            Щоб дізнатися більше про рекламу на основі інтересів і про те, як відмовитися від неї через DAA, відвідайте цю сторінку.
        </li>
        <li>
            Щоб дізнатися більше про відключення та керування файлами cookie у вашому браузері, відвідайте тут.
        </li>
    </ul>

    <div class="section-pol">
        <h3>ПРАВООХОРОННА ДІЯЛЬНІСТЬ ТА РОЗСЛІДУВАННЯ</h3>
        <p>Зверніть увагу, що SakuraTails залишає за собою право і може розкривати особисту інформацію про вас у відповідь на<br/>
            1. запити місцевих, державних або федеральних правоохоронних органів;<br/>
            2. будь-яке судове, адміністративне або аналогічне провадження або розпорядження, наприклад, повістку в суд; <br/>
            3. якщо цього вимагає закон; або <br/>
            4. для розслідування підозр у шахрайстві, переслідуванні, фізичних погрозах або інших порушеннях будь-якого закону, правил або положень, правил або політики Сервісів, або прав третіх осіб, або для розслідування будь-якої підозрюваної поведінки, яка, на нашу думку, є неналежною.</p>  <br/>
    </div>

    <div class="section-pol">
        <h3>ЗМІНА УПРАВЛІННЯ</h3>
        <p>Будь ласка, зверніть увагу, що ми залишаємо за собою право передавати ваші Персональні дані та іншу інформацію як актив у зв'язку із запропонованим або фактичним злиттям або продажем (включаючи будь-які передачі, здійснені в рамках процедури неплатоспроможності або банкрутства), що стосується всього або частини нашого бізнесу, або в рамках корпоративної реорганізації, продажу акцій, фінансування або інших змін у контролі. За таких обставин правонаступник буде зобов'язаний дотримуватися умов цієї Політики конфіденційності. В рамках процесу зміни контролю ми можемо передавати певні ваші Персональні дані кредиторам, аудиторам і радникам, включаючи адвокатів і консультантів.</p>
    </div>

    <div class="section-pol">
        <h3>НЕПЕРСОНІФІКОВАНА ІНФОРМАЦІЯ</h3>
        <p>Ми використовуємо інформацію, що не ідентифікує особу, в сукупності, щоб ми могли покращити Послуги, а також для ділових та адміністративних цілей. <br/> Ми також можемо використовувати або ділитися з іншими сторонами з будь-якою метою зведеними, анонімними, псевдонімізованими або знеособленими даними, які не містять інформації, що дозволяє ідентифікувати особу.</p>
    </div>

    <div class="section-pol">
        <h3>Розіграші</h3>
        <p>Якщо ви надішлете свою електронну адресу для додавання до списку розсилки, лотереї або іншої акції, ми будемо використовувати її для надсилання вам анонсів, спеціальних пропозицій від SakuraTails та її рекламних партнерів, а також оновлень Сервісів. Кожен рекламний електронний лист, який ми надсилаємо, буде містити інформацію про те, як відписатися від нашої розсилки. Ви також можете відписатися від наших рекламних листів, надіславши електронного листа на адресу legal@sakuratails.com.</p>
    </div>

    <div class="section-pol">
        <h3>ДОВІДКОВІ ДЖЕРЕЛА</h3>
        <p>Якщо ви вирішите скористатися нашими рекомендаційними послугами для інформування друга про наші Послуги, ми попросимо вас вказати ім'я та електронну адресу друга. SakuraTails автоматично надішле другу одноразовий електронний лист із запрошенням відвідати Сайт. SakuraTails зберігає цю інформацію з єдиною метою надсилання цього одноразового електронного листа та відстеження успіху нашої реферальної програми.</p>
    </div>

    <div class="section-pol">
        <h3>використання cookies та інших технологій</h3>
        <p>Наш Сайт може передавати «cookie» (рядок інформації, який надсилається веб-сайтом для постійного зберігання на жорсткому диску вашої системи та/або тимчасового зберігання в блоках пам'яті вашого комп'ютера). Мета файлу cookie - повідомити веб-серверу, що ви повернулися на певну сторінку. Сайт може використовувати файли cookie для відстеження вашого статусу та вмісту кошика для покупок або для збереження інформації, зібраної в файлах cookie, щоб надати вам доступ до захищених паролем областей Сайту. Ви можете налаштувати свій браузер так, щоб він не приймав файли cookie. Однак, якщо ви це зробите, ви не зможете в повній мірі користуватися деякими інтерактивними функціями Сайту.</p><br/>
        <p>Прозорі GIF-файли - це мініатюрні графічні зображення з унікальним ідентифікатором, схожі за функціями на файли cookie. На відміну від файлів cookie, які зберігаються на жорсткому диску вашого пристрою, прозорі GIF-файли невидимо вбудовуються на сторінки веб-сайтів або мобільних додатків. Ми можемо використовувати прозорі GIF-файли (також відомі як веб-маяки, веб-жучки або піксельні теги) у зв'язку з нашими Послугами, щоб, серед іншого, відстежувати дії користувачів Послуг, допомагати нам керувати контентом і збирати статистичні дані про використання наших Послуг. Ми та наші постачальники послуг також використовуємо чіткі GIF-файли в електронних листах у форматі HTML, щоб допомогти нам відстежувати відсоток відповідей на електронні листи, визначати, коли наші електронні листи переглядаються, і відстежувати, чи пересилаються наші електронні листи.</p><br/>
        <p>Ми використовуємо автоматизовані пристрої та додатки, такі як Google Analytics, для оцінки використання наших Послуг. Ми також можемо використовувати інші аналітичні засоби для оцінки наших Сервісів. Ми використовуємо ці інструменти, щоб покращити продуктивність наших Сервісів та досвід користувачів. Ці організації можуть використовувати файли cookie та інші технології відстеження, такі як веб-маяки або локальні об'єкти зберігання даних (LSO), для надання своїх послуг. Щоб дізнатися більше про політику конфіденційності Google, перегляньте Політику конфіденційності Google за посиланням https://www.google.com/policies/privacy/. Ви також можете завантажити надбудову для браузера Google Analytics Opt-out Browser Add-on, щоб запобігти використанню їхніх даних Google Analytics, за посиланням https://tools.google.com/dlpage/gaoptout.</p><br/>
        <p>Наразі наші системи не розпізнають сигнали браузера «не відстежувати». Однак ви можете відключити певне відстеження, як описано в цьому розділі (наприклад, вимкнувши файли cookie); ви також можете відмовитися від таргетованої реклами, дотримуючись інструкцій у розділі «Інформація, пов'язана з рекламою» вище.</p>
    </div>

    <div class="section-pol">
        <h3>ЯК МИ ЗАХИЩАЄМО ВАШІ ДАНІ</h3>
        <p>Ми докладаємо комерційно обґрунтованих зусиль для запобігання несанкціонованому доступу через Інтернет до даних відвідувачів, що зберігаються на наших серверах, однак, через відкриту природу Інтернету, SakuraTails не може забезпечити або гарантувати безпеку будь-якої інформації, яку ви передаєте нам, або будь-якої інформації, наданої в Інтернеті, і ви робите це на свій страх і ризик. Користувачі повинні прийняти всі ризики, пов'язані з будь-якою передачею даних, включаючи ризик того, що їхня особиста інформація може бути перехоплена під час передачі. SakuraTails не несе відповідальності за розголошення вашої особистої інформації через помилки при передачі або несанкціоновані дії третіх осіб.</p><br/>
        <p>Сайт шифрує номер вашої кредитної картки та іншу особисту інформацію за допомогою технології захищених сокетів (SSL), щоб забезпечити безпечну передачу інформації з вашого комп'ютера на наші сервери. Крім того, тільки ті співробітники і треті особи, яким необхідний доступ до вашої інформації для виконання своїх обов'язків, мають право на такий доступ.</p>
    </div>

    <div class="section-pol">
        <h3>ДОСТУП ТА ОНОВЛЕННЯ ВАШОЇ ОСОБИСТОЇ ІНФОРМАЦІЇ ТА НАЛАШТУВАНЬ</h3>
        <p>Якщо ви зареєстрований користувач, ви можете отримати доступ і оновити свою реєстраційну інформацію та свої налаштування щодо отримання електронних листів або інших повідомлень від нас, надіславши електронного листа на адресу legal@sakuratails.com.</p><br/>
        <p>Ми вживатимемо комерційно обґрунтованих заходів для виконання ваших запитів на відмову від розсилки в найкоротші терміни, як того вимагає чинне законодавство, але ви все одно можете отримувати від нас рекламні електронні листи протягом десяти робочих днів, поки ми опрацьовуватимемо ваш запит.</p><br/>
        <p>Хоча ми докладаємо зусиль, щоб задовольнити запити на обмеження використання вашої інформації, ми залишаємо за собою право видалити всю або будь-яку частину інформації про клієнта, якщо ми не можемо обґрунтовано виконати запитуване обмеження.
        </p><br/>
        <p>Ми закликаємо зацікавлених осіб висловлювати будь-які занепокоєння, використовуючи надану контактну інформацію, і ми будемо розслідувати та намагатися вирішити будь-які скарги та суперечки щодо використання та розкриття особистої інформації.</p>
    </div>

    <div class="section-pol">
        <h3>КОНФІДЕНЦІЙНІСТЬ ДІТЕЙ ТА БАТЬКІВСЬКИЙ КОНТРОЛЬ</h3>
        <p>Цей Сайт і Додаток не призначені для осіб молодше 14 років, і ми не маємо наміру збирати або запитувати особисту інформацію від осіб молодше 14 років. Якщо вам не виповнилося 14 років, ви не маєте права користуватися Сайтом. Батьки повинні знати, що в Інтернеті існують інструменти батьківського контролю, які можна використовувати, щоб запобігти наданню вашими дітьми інформації в Інтернеті без дозволу батьків або доступу до матеріалів, які можуть завдати шкоди неповнолітнім. Якщо ми отримаємо повідомлення про те, що дитина віком до 14 років надала нам особисту інформацію, ми докладемо всіх зусиль, щоб видалити таку інформацію з нашої бази даних.</p>
    </div>

    <div class="section-pol">
        <h3>ПРАВИЛА ТА УМОВИ ВИКОРИСТАННЯ САЙТУ</h3>
        <p>Використання цього Сайту регулюється юридичними положеннями, що містяться в наших Умовах та положеннях, і підлягає їх виконанню. Ваше використання або доступ до Сайту означає вашу згоду на дотримання цих положень. ЯКЩО ВИ НЕ ЗГОДНІ З ЦИМИ УМОВАМИ, ВИ НЕ МОЖЕТЕ ОТРИМАТИ ДОСТУП ДО САЙТУ АБО ВИКОРИСТОВУВАТИ ЙОГО БУДЬ-ЯКИМ ІНШИМ ЧИНОМ.</p>
    </div>

    </div>
              </main></>
    
              <footer>
                <div className='footer-div'>
                  <nav>
                    <div className='top-footer-div'>
                    <div className='logo-footer-div'>
                          <img className='footer-wolf' href='/' src={WhiteWolf} alt='logo SakuraTails'></img>
                          <a className='head-logo footer-logo' href='/'>SakuraTails</a>
                      </div>
                      <div className='nav-footer-div'>
                        <div className='left-nav-div'>
                      <ul>
                          <li className='section-footer-bold'><a className='section-footer section-footer-bold'>Тільки на SakuraTails</a></li>
                          <li className='section-footer'><a className='section-footer' href='#'>Магазин</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>Подарункові коробки</a></li>
                          <li className='section-footer'><a className='section-footer' href='#subcribtion-section'>Підписка</a></li>
                      </ul>
                      </div>
                      <div className='right-nav-div'>
                      <ul>
                          <li className='section-footer-bold'><a className='section-footer section-footer-bold'>Підтримка</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>Політика конфіденційності</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>Про нас</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>Умови</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>FAQ</a></li>
                          <li className='section-footer'><a className='section-footer' href='https://www.figma.com/'>Політика доставки</a></li>
                      </ul>
                      </div>
                      </div>
                      <div className='pay-footer-div'>
                        <div className='we-accept-div'>
                      <h3 className='we-accept'>We accept</h3>
                      </div>
                        <div className='inline-pay-div'>
                      <div className='icon-pay-div'>
                      <img src={Amex}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Apple}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={F}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Discover}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Google}></img>
                      </div>
                      </div>
                      <div className='inline-pay-div'>
                      <div className='icon-pay-div'>
                      <img src={Mastercard}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Paypal}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Shop}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={V}></img>
                      </div>
                      <div className='icon-pay-div'>
                      <img src={Visa}></img>
                      </div>
                      </div>
                      <div className='qr-div'>
                      <img src={Qr}></img>
                      </div>
                      </div>
                      </div>
                  </nav>
                  </div>
                  <div className='white-line'></div>
                  <div className='footer-div'>
                  <div className='bottom-footer-div'>
                  
                    <div>
                  <h3 className='sakuratails'>2024 SakuraTails</h3>
                  </div>
                      <ul>
                      <div className='social-box-div'>
                          <div className='social-div'>
                          <li><a href='https://www.instagram.com/'><img src={Instagram}></img></a></li>
                          </div>
                          <div className='social-div'>
                          <li><a href='https://twitter.com/'><img src={X}></img></a></li>
                          </div>
                          <div className='social-div'>
                          <li><a href='https://www.facebook.com/'><img src={Facebook}></img></a></li>
                          </div>
                          <div className='social-div'>
                          <li><a href='https://www.tiktok.com/'><img src={Tiktok}></img></a></li>
                          </div>
                          </div>
                      </ul>
                      </div>
                      </div>
              </footer></>
              </body>
    
    
      )
  }